# Table of Content
01. Import Libraries
02. Import Data
03. Dropping Unnecessary Columns
04. Renaming Columns 
05. Export Data

# 01. Import Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# 02. Import Data

In [2]:
# Define the main project folder path
path = r'C:\Users\saich\Desktop\CareerFoundry\Data Immersion\Achievement 4 Python Fundamentals for Data Analysts\04-2023 Instacart Basket Analysis (github)'

In [3]:
# Import 'customers' data set from 'Original Data' folder
cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

In [4]:
cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
cust.shape

(206209, 10)

# 03. Dropping Unnecessary Columns

In [10]:
# Drop the 'fist_name' and 'last_name' columns as they are personal identifiable information (PII)
cust.drop(columns = ['First Name', 'Surnam'], inplace = True)

In [12]:
cust.head()

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

# 04. Renaming Columns

In [13]:
# Rename the following columns to give more standardized-format names
cust.rename(columns = {'Gender' : 'gender', 'STATE' : 'state', 'Age' : 'age', 'n_dependants' : 'dependant_counts', 'fam_status' : 'family_status'}, inplace = True)

In [14]:
cust.head()

,user_id,gender,state,age,date_joined,dependant_counts,family_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374

# 05. Export Data

In [15]:
# Dimension check for 'cust' dataframe after data wrangling
cust.shape

(206209, 8)

In [16]:
# Export 'cust' dataframe to 'Prepared Data' folder in csv format
cust.to_csv(os.path.join(path, '02 Data', 'Prepared Data', 'customers_wrangled.csv'))